# BRepBuilder Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BRepBuilder Properties
BRepBuilder Class See Also
---
The BRepBuilder type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from ShapeBuilder.) |

# See Also
BRepBuilder Class
Autodesk.Revit.DB Namespace